In [64]:
import pandas as pd

In [65]:
df = pd.read_csv('ds_salaries.csv')
df.head()

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2023,SE,FT,Principal Data Scientist,80000,EUR,85847,ES,100,ES,L
1,2023,MI,CT,ML Engineer,30000,USD,30000,US,100,US,S
2,2023,MI,CT,ML Engineer,25500,USD,25500,US,100,US,S
3,2023,SE,FT,Data Scientist,175000,USD,175000,CA,100,CA,M
4,2023,SE,FT,Data Scientist,120000,USD,120000,CA,100,CA,M

In [66]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3755 entries, 0 to 3754
Data columns (total 11 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   work_year           3755 non-null   int64
 1   experience_level    3755 non-null   object
 2   employment_type     3755 non-null   object
 3   job_title           3755 non-null   object
 4   salary              3755 non-null   int64
 5   salary_currency     3755 non-null   object
 6   salary_in_usd       3755 non-null   int64
 7   employee_residence  3755 non-null   object
 8   remote_ratio        3755 non-null   int64
 9   company_location    3755 non-null   object
 10  company_size        3755 non-null   object
dtypes: int64(4), object(7)
memory usage: 322.8+ KB

There is no null data

- work_year: filtering only 2023
- job_title: filter by Data Scientist

In [67]:
df['data_scientist_job'] = df['job_title'].apply(lambda x: 1 if 'data scientist' in x.lower() else 0)

In [68]:
mask = df['work_year'] == 2023
df = df[mask]

In [69]:
mask = df['data_scientist_job'] == 1
df = df[mask]

In [70]:
df['job_title'].unique()

array(['Principal Data Scientist', 'Data Scientist',
       'Applied Data Scientist'], dtype=object)

- Change 'Lead Data Scientist' to 'Data Scientist Lead'

In [71]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 374 entries, 0 to 1818
Data columns (total 12 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   work_year           374 non-null    int64
 1   experience_level    374 non-null    object
 2   employment_type     374 non-null    object
 3   job_title           374 non-null    object
 4   salary              374 non-null    int64
 5   salary_currency     374 non-null    object
 6   salary_in_usd       374 non-null    int64
 7   employee_residence  374 non-null    object
 8   remote_ratio        374 non-null    int64
 9   company_location    374 non-null    object
 10  company_size        374 non-null    object
 11  data_scientist_job  374 non-null    int64
dtypes: int64(5), object(7)
memory usage: 38.0+ KB

In [72]:
df['job_title'] = df['job_title'].apply(lambda x: 'Lead ' + x.replace(' Lead', '') if 'Data Scientist Lead' in x else x)

In [73]:
df['job_title'].unique()

array(['Principal Data Scientist', 'Data Scientist',
       'Applied Data Scientist'], dtype=object)

In [74]:
df.drop('data_scientist_job', axis=1, inplace=True)

In [76]:
df.to_csv('ds_salaries_cleaned.csv', index=False)

In [77]:
pd.read_csv('ds_salaries_cleaned.csv')

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2023,SE,FT,Principal Data Scientist,80000,EUR,85847,ES,100,ES,L
1,2023,SE,FT,Data Scientist,175000,USD,175000,CA,100,CA,M
2,2023,SE,FT,Data Scientist,120000,USD,120000,CA,100,CA,M
3,2023,SE,FT,Data Scientist,219000,USD,219000,CA,0,CA,M
4,2023,SE,FT,Data Scientist,141000,USD,141000,CA,0,CA,M
...,...,...,...,...,...,...,...,...,...,...,...
369,2023,SE,FT,Data Scientist,120000,USD,120000,US,0,US,M
370,2023,SE,FT,Data Scientist,120000,USD,120000,CA,0,CA,M
371,2023,SE,FT,Data Scientist,110000,USD,110000,CA,0,CA,M
372,2023,MI,FT,Data Scientist,130000,USD,130000,US,0,US,M
373,2023,MI,FT,Data Scientist,90000,USD,90000,US,0,US,M